//Задача №1 - Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

int RaiseToDegree(int numberA, int numberB) //Метод, который возводит в степерь число А в степень Б 
{
    int degree = 0;
    for(int i = 1; i == numberB; i++)
    {
        degree = degree * i;
    }
    return degree;
}

//Задача №2 - Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

//Задача №3 - Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]